app/Controllers/Users.php

    public function create()
    {
        $rules = $this->validate($this->model->getValidationRules());
        if (!$rules) {
            $response = [
                'error' => $this->validator->getErrors()
            ];
            return $this->failValidationErrors($response);
        }

        $username = $this->request->getVar('username');
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $hashedPassword = password_hash($password, PASSWORD_DEFAULT);
        $data = $this->model->insert([
            'email' => esc($this->request->getVar('email')),
            'username' => esc($this->request->getVar('username')),
            'password' => esc($hashedPassword),
            'profile' => esc($this->request->getVar('profile')),
        ]);
---
INSERT INTO `users` (`email`, `username`, `password`, `profile`, `created_at`, `updated_at`) VALUES ('admin@gmail.com', 'masterblad12', '$2y$10$PEIED/KQ9YSZa5wZ7W8Ms.alio5jmsW9EIc1jepAs7gjX8Iajaee6', 'Untitled.jpg', '2023-05-24 06:38:57', '2023-05-24 06:38:57')